code to replicate output below. code on the cell given, do not rerun the example or run code on the example cell

In [2]:
import pandas as pd
import numpy as np

In [9]:
# 1. create dataframe below

  product_name  price  quantity  weight
1       laptop   1200       100     0.5
2      printer    150        20     NaN
3       tablet    300       300     0.2
4         desk    450        55     2.4
5        chair    200       110     NaN

In [3]:
# 1. code here
DataProduct = pd.DataFrame({'product_name' : ['laptop','printer','tablet','desk','chair'],
                            'price' : [1200, 150, 300, 450, 200],
                            'quantity' : [100, 20, 300, 55, 110],
                            'weight' : [0.5,np.nan,0.2,2.4,np.nan]})
DataProduct.index = [1,2,3,4,5]
DataProduct

  product_name  price  quantity  weight
1       laptop   1200       100     0.5
2      printer    150        20     NaN
3       tablet    300       300     0.2
4         desk    450        55     2.4
5        chair    200       110     NaN

In [10]:
# 2. show index

Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [4]:
# 2. code here
DataProduct.index

Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [11]:
# 3. show columns

Index(['product_name', 'price', 'quantity', 'weight'], dtype='object')

In [5]:
# 3. code here
DataProduct.columns

Index(['product_name', 'price', 'quantity', 'weight'], dtype='object')

In [12]:
# 4. show data types

product_name     object
price             int64
quantity          int64
weight          float64
dtype: object

In [6]:
# 4. code here
DataProduct.dtypes

product_name     object
price             int64
quantity          int64
weight          float64
dtype: object

In [13]:
# 5. show statistics summary

             price    quantity    weight
count     5.000000    5.000000  3.000000
mean    460.000000  117.000000  1.033333
std     429.243521  108.489631  1.193035
min     150.000000   20.000000  0.200000
25%     200.000000   55.000000  0.350000
50%     300.000000  100.000000  0.500000
75%     450.000000  110.000000  1.450000
max    1200.000000  300.000000  2.400000

In [7]:
# 5. code here
DataProduct.describe()

             price    quantity    weight
count     5.000000    5.000000  3.000000
mean    460.000000  117.000000  1.033333
std     429.243521  108.489631  1.193035
min     150.000000   20.000000  0.200000
25%     200.000000   55.000000  0.350000
50%     300.000000  100.000000  0.500000
75%     450.000000  110.000000  1.450000
max    1200.000000  300.000000  2.400000

In [14]:
# 6. show how many null values in columns

product_name    0
price           0
quantity        0
weight          2
dtype: int64

In [8]:
# 6. code here
DataProduct.isna().sum()

product_name    0
price           0
quantity        0
weight          2
dtype: int64

In [18]:
# 7. show dataframe dimension (row, columns)

(5, 4)

In [9]:
# 7. code here
DataProduct.shape

(5, 4)

In [19]:
# 8. show total rows

5

In [10]:
# 8. code here
DataProduct.shape[0]

5

In [20]:
# 9. show total columns

4

In [11]:
# 9. code here
DataProduct.shape[1]

4

In [15]:
# 10. remove rows with null

  product_name  price  quantity  weight
1       laptop   1200       100     0.5
3       tablet    300       300     0.2
4         desk    450        55     2.4

In [12]:
# 10. code here
DataProduct.dropna()

  product_name  price  quantity  weight
1       laptop   1200       100     0.5
3       tablet    300       300     0.2
4         desk    450        55     2.4

In [16]:
# 11. remove columns with null

  product_name  price  quantity
1       laptop   1200       100
2      printer    150        20
3       tablet    300       300
4         desk    450        55
5        chair    200       110

In [13]:
# 11. code here
DataProduct.dropna(axis=1)

  product_name  price  quantity
1       laptop   1200       100
2      printer    150        20
3       tablet    300       300
4         desk    450        55
5        chair    200       110

In [21]:
# 12. add new column, revenue = price x quantity

In [22]:
df

  product_name  price  quantity  weight  revenue
1       laptop   1200       100     0.5   120000
2      printer    150        20     NaN     3000
3       tablet    300       300     0.2    90000
4         desk    450        55     2.4    24750
5        chair    200       110     NaN    22000

In [14]:
# 12. code here
DataProduct['revenue'] = DataProduct['price']*DataProduct['quantity']

In [15]:
DataProduct

  product_name  price  quantity  weight  revenue
1       laptop   1200       100     0.5   120000
2      printer    150        20     NaN     3000
3       tablet    300       300     0.2    90000
4         desk    450        55     2.4    24750
5        chair    200       110     NaN    22000

In [23]:
# 13. select rows with revenue > 10000

  product_name  price  quantity  weight  revenue
1       laptop   1200       100     0.5   120000
3       tablet    300       300     0.2    90000
4         desk    450        55     2.4    24750
5        chair    200       110     NaN    22000

In [17]:
# 13. code here
DataProduct[DataProduct['revenue']>10000]

  product_name  price  quantity  weight  revenue
1       laptop   1200       100     0.5   120000
3       tablet    300       300     0.2    90000
4         desk    450        55     2.4    24750
5        chair    200       110     NaN    22000

In [6]:
# 14. select row with the highest price, show product_name and price

  product_name  price
1       laptop   1200

In [18]:
# 14. code here
DataProduct[['product_name','price']].head(1)

  product_name  price
1       laptop   1200

In [28]:
# 15. select row with the highest quantity, get product_name

'tablet'

In [19]:
# 15. code here
DataProduct.loc[DataProduct['quantity'] == DataProduct['quantity'].max(),'product_name'].item()

'tablet'

In [31]:
# 16. select row with weight less than 1kg

  product_name  price  quantity  weight  revenue
1       laptop   1200       100     0.5   120000
3       tablet    300       300     0.2    90000

In [20]:
# 16. code here
DataProduct[DataProduct['weight'] < 1]

  product_name  price  quantity  weight  revenue
1       laptop   1200       100     0.5   120000
3       tablet    300       300     0.2    90000